[
  {
    "path": "posts/2021-01-20-Assignment1/",
    "title": "ISSS608 AY2020-21_T2 Visual Analytic DataViz Makeover1",
    "description": "Description: Visualisation and analysis of MOM(Manpower Research and Statistics Department) Report on Labour Force in Singapore 2019",
    "author": [
      {
        "name": "Jihun NAM",
        "url": {}
      }
    ],
    "date": "2021-01-28",
    "categories": [],
    "contents": "\n1. Overview\nThe Report on Labour Force in Singapore is an annual report on Singapore’s labour market and it analyses diverse facets of Singapore’s labour force. In this post, the chart 6 “Resident labour force by age) in the original report will be evaluated in terms of”clarity\" and “aesthetics”. Then an alternative graphical presentation that represents more easier to understand the context will be presented and discussed.\nFigure0 : Original visualisationThe original source of the data can be found on page 22 of report: Report: Labour Force in Singapore 2019\nThe data is available at https://stats.mom.gov.sg/Pages/Labour-Force-Tables2019.aspx, and below three datasets were used for analysis.\nTable2: Key Characteristics of Resident Labour Force, 2009 - 2019 (June)\nTable5: Resident Labour Force Participation Rate by Age and Sex, 2009 - 2019 (June)\nTable7: Resident Labour Force Aged Fifteen Years and Over by Age and Sex, 2009 - 2019 (June)\n2. Critiques of the graph\n2.1. Clarity\nMissing graphs for illustration\nThe explanation above this chart illustrates four big things: (1) the share of residents population, (2) LFPR(Labour Force Prticipation Rate), (3) share of resident labour force, (4) Median age of residents. However, information of (3) and (4) is displayed in the chart and other two are merely stated in words.\nEspecially, (1) the share of residents population by age is mentioned only with footnotes, so it is difficult to understand and match the other data. Also, LFPR graph is not shown in this chart, so understanding the trend of changes of LFPR is difficult.\nMissing data for comparison\nTo compare the data accurately, all the data sets should be ready for use. Closely looking into LFPR data set (Table 5), LFPR of 55 & over age group data does not exist. Therefore, we cannot use the figures of 55 & over age group to compare with the share of residents population. To make all the data sets in the same format, the share of residents population data set should be divided into four age groups, 15-24, 25-54, 55-64, and 65&over.\nInappropriate usage of graph\nThe median age of residents data between two years(2009 and 2019) are being displayed with dotted lines. However, because the figures of median age are continuous values, putting the dotted lines on categorical variables (age groups) is inappropriate.\n2.2. Aesthetics\nSelection of graph\nIn this chart, line graphs are used to show changes of the share of resident labour force by age. However, it is hard to understand how amounts of the share among the age groups were changed.\nHighlighting of important message\nIn order to make readers understand easier, at least this chart needs to highlight important figures to deliever clearer message. Even the table bellow the line graphs show that the figures of the share of each age group, readers can not easily sum up the figures to evaluate the differences between two fiscal years.\nLabelling and captions\n“June 20xx” labels are inserted multiple times unnecessarily. The duplicated labels can be removed to make the chart much simpler.\n“Per Cent” caption should be placed within the graph.\n“Source” and “Note” bellow the charts are not aligned, in terms of format.\n3. Alternative suggestion of the graph\n3.1. Sktechs of graphical presentation and advantages\nScratch1 - The share of residents population\nThe first key message to convey is the change in the share of residents population. Bellow box plot clearly shows that the changes in shares of resident population among the age groups and between two years(2009 and 2019).\nFigure1 : scatch1Scratch2 - LFPR by age\nIn addition, the second key message to deliver is the change in LFPR (Labour Force Participation Rate). Bellow box plot also clearly displays the changes in LFPR among the age groups and between two years.\nFigure2 : scatch1Scratch3 - The share of resident labour force\nThe chart bellow Figure3 represents the portion of changes of the share of resident labour force between 2009 and 2019.\nFigure3 : scatch3Scratch4 - Median age of residents\nThe change of median age of residents in the labour force between 2009 and 2019 can be shown clearer with line graph.\nFigure4 : scatch43.2. Final dashboard of visualisation using Tableau.\nFigure5 : Final Dashboard3.3. Step-by-step preparation of visualization\nPreparation of data sets\n1) Resident labour force participation rate by age\nThe data can be used in Table5 (Resident Labour Force Participation Rate by Age and Sex, 2009 - 2019 (June))\n2) The share of resident labor force\nThe data can be extracted in Table7 (Resident Labour Force Aged Fifteen Years and Over by Age and Sex, 2009 - 2019 (June))\n3) The share of residents population by age\nIn order to get the figures of the share of residents population, Table7 and Table5 are used for counter-calculation.\nThe population figures are calculated by dividing “Resident labour force(Table7)” by “Resident labour force participation rate(Table5)”\n4) The Median age of labour force\nThe data is available in Table2 (Key Characteristics of Resident Labour Force, 2009 - 2019)\nUpload and integrate data in Tableau \n5. Major observations\n\n\n\n",
    "preview": {},
    "last_modified": "2021-01-28T10:44:36+08:00",
    "input_file": "Assignment1.utf8.md"
  },
  {
    "path": "posts/2021-01-20-MarkDown-Guide/",
    "title": "MarkDown Guide",
    "description": "This is MarkDown Guide",
    "author": [
      {
        "name": "Jihun NAM",
        "url": "https://github.com/jeerohoon"
      }
    ],
    "date": "2021-01-20",
    "categories": [],
    "contents": "\nFirst Level Header\ncontent\nSecond Level Header\ncontent\nThis is a first thing\nThis is a second thing\nThis is a third thing\nbullet one\nbullet two\nbullet three new content1 new content2 > Blockquotes\nOfficial Guide Link\nYou can insert links like this https://www.markdownguide.org/basic-syntax/.\nOr you can insert links like this my website.\nOr you can insert links with caption like this my website.\nOr link for official guide https://www.markdownguide.org/basic-syntax/\nImportant Features\nEmphasis\nBold To bold text, add two asterisks or underscores before and after a word or phrase. To bold the middle of a word for emphasis, add two asterisks without spaces around the letters.\nI just love bold text.\nI just love bold text.\nItalic To italicize text, add one asterisk or underscore before and after a word or phrase. To italicize the middle of a word for emphasis, add one asterisk without spaces around the letters.\nItalicized text is the cat’s meow.\nItalicized text is the cat’s meow.\nAcatmeow\nBold and Italic To emphasize text with bold and italics at the same time, add three asterisks or underscores before and after a word or phrase. To bold and italicize the middle of a word for emphasis, add three asterisks without spaces around the letters.\nThis text is really important.\nThis text is really important.\nThis text is really important.\nThis text is really important.\nThis is reallyveryimportant text.\nEmphasis\nBlockquotes To create a blockquote, add a > in front of a paragraph.\n\nDorothy followed her through many of the beautiful rooms in her castle.\n\nBlockquotes with Multiple Paragraphs Blockquotes can contain multiple paragraphs. Add a > on the blank lines between the paragraphs.\n\nDorothy followed her through many of the beautiful rooms in her castle.\nThe Witch bade her clean the pots and kettles and sweep the floor and keep the fire fed with wood.\n\nNested Blockquotes Blockquotes can be nested. Add a >> in front of the paragraph you want to nest.\n\nDorothy followed her through many of the beautiful rooms in her castle.\n\nThe Witch bade her clean the pots and kettles and sweep the floor and keep the fire fed with wood.\n\n\nBlockquotes with Other Elements Blockquotes can contain other Markdown formatted elements. Not all elements can be used — you’ll need to experiment to see which ones work.\n\nThe quarterly results look great!\nRevenue was off the chart.\nProfits were higher than ever.\nEverything is going according to plan.\n\nImages\nFrom image file To add an image, add an exclamation mark (!), followed by alt text in brackets, and the path or URL to the image asset in parentheses. You can optionally add a title after the URL in the parentheses.\nTest image!From link To add a link to an image, enclose the Markdown for the image in brackets, and then add the link in parentheses.\n\nReference-style Links\nReference-style links are a special kind of link that make URLs easier to display and read in Markdown. Reference-style links are constructed in two parts: the part you keep inline with your text and the part you store somewhere else in the file to keep the text easy to read.\nIn one example, researchers studied the covid Bastard et al. (2020). COVID (2020)\nReferences\n\n\n\nBastard, Paul, Lindsey B. Rosen, Qian Zhang, Eleftherios Michailidis, Hans-Heinrich Hoffmann, Yu Zhang, Karim Dorgham, Quentin Philippot, Jérémie Rosain, and Vivien Béziat. 2020. “Autoantibodies Against Type I IFNs in Patients with Life-Threatening COVID-19.” Science 370 (6515).\n\n\nCOVID, Team CDC. 2020. Characteristics of Health Care Personnel with COVID-19-United States, February 12-April 9, 2020.\n\n\n\n\n",
    "preview": {},
    "last_modified": "2021-01-28T10:36:29+08:00",
    "input_file": "MarkDown-Guide.utf8.md"
  },
  {
    "path": "posts/2021-01-04-my-first-post/",
    "title": "My first post",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "Jihun NAM",
        "url": "https://github.com/jeerohoon"
      }
    ],
    "date": "2021-01-04",
    "categories": [],
    "contents": "\n1.0 Overview\nCorrelation coefficient is a popular statistic that use to measure the type and strength of the relationship between two variables. The values of a correlation coefficient ranges between -1.0 and 1.0. A correlation coefficient of 1 shows a perfect linear relationship between the two variables, while a -1.0 shows a perfect inverse relationship between the two variables. A correlation coeficient of 0.0 shows no linear relationship between the two variables.\nWhen multivariate data are used, the correlation coeficeints of the pair comparisons are displayed in a table form known as correlation matrix or scatterplot matrix.\nThere are three broad reasons for computing a correlation matrix.\nTo reveal the relationship between highdimensional variables pairwisely.\nTo input into other analyses. For example, people commonly use correlation matrixes as inputs for exploratory factor analysis, confirmatory factor analysis, structural equation models, and linear regression when excluding missing values pairwise.\nAs a diagnostic when checking other analyses. For example, with linear regression a high amount of correlations suggests that the linear regression’s estimates will be unreliable.\nWhen the data is large, both in terms of the number of observations and the number of variables, Corrgram tend to be used to visually explore and analyse the structure and the patterns of relations among variables. It is designed based on two main schemes:\nRendering the value of a correlation to depict its sign and magnitude, and\nReordering the variables in a correlation matrix so that “similar” variables are positioned adjacently, facilitating perception.\nIn this hands-on exercise, you will learn how to plot data visualisation for visualising correlation matrix with R. It consists of three main sections. First, you will learn how to create correlation matrix using pairs() of R Graphics. Next, you will learn how to plot corrgram using corrplot package of R Lastly, you will learn how to create an interactive correlation matrix using plotly R. .\n2.0 Installing and Launching R Packages\nBefore you get started, you are required:\nto start a new R project, and\nto create a new R Markdown document.\nNext, you will use the code chunk below to install and launch corrplot, ggpubr, plotly and tidyverse in RStudio.\n\n\npackages = c('ggpubr', 'tidyverse')\n\nfor(p in packages){library\n  if(!require(p, character.only = T)){\n    install.packages(p)\n  }\n  library(p, character.only = T)\n}\n\n\n\n3.0 Importing and Preparing The Data Set\nIn this hands-on exercise, the Wine Quality Data Set of UCI Machine Learning Repository will be used. The data set consists of 13 variables and 6497 observations. For the purpose of this exercise, we have combined the red wine and white wine data into one data file. It is called wine_quality and is in csv file format.\n3.1 Importing Data\nFirst, let us import the data into R by using read_csv() of readr package.\n\n\nwine <- read_csv(\"data/wine_quality.csv\")\n\n\n\nNotice that beside quality and type, the rest of the variables are numerical and continuous data type.\n4.0 Univariate EDA with Histogram\nIn the figure below, multiple histograms are plottted to reveal the distribution of the selected variables in the wine quality data sets.\n\n\n\nThe code chunks used to create the data visualisation consists of two main parts. First, we will create the individual histograms using the code chunk below.\n\n\nfa <- ggplot(data=wine, aes(x= `fixed acidity`)) +\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\nva <- ggplot(data=wine, aes(x= `volatile acidity`)) +\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\nca <- ggplot(data=wine, aes(x= `citric acid`)) +\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\nrs <- ggplot(data=wine, aes(x= `residual sugar`)) +\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\nch <- ggplot(data=wine, aes(x= `chlorides`)) +\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\nfSO2 <- ggplot(data=wine, aes(x= `free sulfur dioxide`)) +\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\ntSO2 <- ggplot(data=wine, aes(x= `total sulfur dioxide`)) +\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\ndensity <- ggplot(data=wine, aes(x= density)) +\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\npH <- ggplot(data=wine, aes(x= pH)) +\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\nsulphates <- ggplot(data=wine, aes(x= sulphates)) +\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\nalcohol <- ggplot(data=wine, aes(x= alcohol)) +\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\n\n\n\nNext, the ggarrange function of ggpur package is used to group these histograms together.\n\n\nggarrange(fa, va, ca, rs, ch, fSO2, tSO2, density, pH, sulphates, alcohol, \n          ncol = 4, nrow = 3)\n\n\n\n\n\n\n",
    "preview": "posts/2021-01-04-my-first-post/my-first-post_files/figure-html5/unnamed-chunk-3-1.png",
    "last_modified": "2021-01-20T22:24:53+08:00",
    "input_file": {}
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to IDEA",
    "description": "Welcome to our new blog, IDEA. We hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "Jihun NAM",
        "url": "https://github.com/jeerohoon"
      }
    ],
    "date": "2021-01-04",
    "categories": [],
    "contents": "\n\n\n\n",
    "preview": {},
    "last_modified": "2021-01-04T20:59:41+08:00",
    "input_file": {}
  }
]
