[
  {
    "path": "posts/2021-03-20-Assignment3/",
    "title": "ISSS608 AY2020-21_T2 Visual Analytic DataViz Makeover3",
    "description": "Description: South-east Asia Armed Conflict Analysis",
    "author": [
      {
        "name": "Jihun NAM",
        "url": {}
      },
      {
        "name": "",
        "url": {}
      }
    ],
    "date": "2021-03-21",
    "categories": [],
    "contents": "\n1. Overview\nThis post will show how to visualise the spatio-temporal patterns of armed conflict in selected South-east Asia countries between 2015-2020. The original chart can be found at South-east Asia Armed Conflict Analysis Firstly, we will criticize the original charts then show how to make better visualization from the same data set.\nOriginal chart\nOriginal visualisationIn this Analysis, below codebook and data files were used for analysis.\nRaw Data Southeast-Asia_2010-2020_Oct31.xlsx\nArmed Conflict Location & Event Data Project (ACLED) Codebook codebook\n\n\n\n1.1. Skim of raw data\n\nTable 1: Data summary\nName\nraw_df\nNumber of rows\n38244\nNumber of columns\n29\n_______________________\n\nColumn type frequency:\n\ncharacter\n16\nnumeric\n12\nPOSIXct\n1\n________________________\n\nGroup variables\nNone\nVariable type: character\nskim_variable\nn_missing\ncomplete_rate\nmin\nmax\nempty\nn_unique\nwhitespace\nEVENT_ID_CNTY\n0\n1.00\n4\n8\n0\n38244\n0\nEVENT_TYPE\n0\n1.00\n5\n26\n0\n6\n0\nSUB_EVENT_TYPE\n0\n1.00\n5\n35\n0\n25\n0\nACTOR1\n0\n1.00\n7\n107\n0\n314\n0\nASSOC_ACTOR_1\n28700\n0.25\n7\n1213\n0\n1336\n0\nACTOR2\n12558\n0.67\n7\n97\n0\n274\n0\nASSOC_ACTOR_2\n27948\n0.27\n6\n390\n0\n998\n0\nREGION\n0\n1.00\n14\n14\n0\n1\n0\nCOUNTRY\n0\n1.00\n4\n11\n0\n8\n0\nADMIN1\n0\n1.00\n3\n47\n0\n252\n0\nADMIN2\n20\n1.00\n3\n26\n0\n1295\n0\nADMIN3\n2917\n0.92\n2\n28\n0\n3370\n0\nLOCATION\n0\n1.00\n2\n30\n0\n6573\n0\nSOURCE\n0\n1.00\n2\n168\n0\n2166\n0\nSOURCE_SCALE\n0\n1.00\n5\n25\n0\n20\n0\nNOTES\n0\n1.00\n30\n1609\n0\n36441\n0\nVariable type: numeric\nskim_variable\nn_missing\ncomplete_rate\nmean\nsd\np0\np25\np50\np75\np100\nhist\nISO\n0\n1\n4.445500e+02\n264.34\n104.00\n1.040000e+02\n6.080000e+02\n6.080000e+02\n7.640000e+02\n▇▃▁▇▆\nEVENT_ID_NO_CNTY\n0\n1\n4.494230e+03\n3117.74\n1.00\n1.734000e+03\n4.091500e+03\n7.027000e+03\n1.127400e+04\n▇▆▅▅▃\nYEAR\n0\n1\n2.016310e+03\n2.91\n2010.00\n2.014000e+03\n2.017000e+03\n2.019000e+03\n2.020000e+03\n▃▃▆▇▇\nTIME_PRECISION\n0\n1\n1.060000e+00\n0.28\n1.00\n1.000000e+00\n1.000000e+00\n1.000000e+00\n3.000000e+00\n▇▁▁▁▁\nINTER1\n0\n1\n3.200000e+00\n2.06\n1.00\n1.000000e+00\n2.000000e+00\n6.000000e+00\n8.000000e+00\n▇▂▁▅▁\nINTER2\n0\n1\n2.920000e+00\n3.07\n0.00\n0.000000e+00\n1.000000e+00\n7.000000e+00\n8.000000e+00\n▇▂▁▁▅\nINTERACTION\n0\n1\n3.175000e+01\n19.96\n10.00\n1.200000e+01\n2.700000e+01\n6.000000e+01\n8.000000e+01\n▇▃▁▅▁\nLATITUDE\n0\n1\n1.174000e+01\n8.64\n-10.17\n6.570000e+00\n1.336000e+01\n1.794000e+01\n2.773000e+01\n▂▁▇▇▅\nLONGITUDE\n0\n1\n1.080200e+02\n11.73\n92.20\n9.796000e+01\n1.018600e+02\n1.209800e+02\n1.408600e+02\n▇▂▃▂▁\nGEO_PRECISION\n0\n1\n1.490000e+00\n0.56\n1.00\n1.000000e+00\n1.000000e+00\n2.000000e+00\n3.000000e+00\n▇▁▆▁▁\nFATALITIES\n0\n1\n6.700000e-01\n2.97\n0.00\n0.000000e+00\n0.000000e+00\n1.000000e+00\n2.430000e+02\n▇▁▁▁▁\nTIMESTAMP\n0\n1\n1.578913e+09\n14870918.64\n1552576414.00\n1.567539e+09\n1.579013e+09\n1.591125e+09\n1.604424e+09\n▅▃▃▇▂\nVariable type: POSIXct\nskim_variable\nn_missing\ncomplete_rate\nmin\nmax\nmedian\nn_unique\nEVENT_DATE\n0\n1\n2010-01-01\n2020-10-31\n2017-04-13\n3911\n\n1.2. Data columns of raw data\ncodecode2. Critique of the original charts\n2.1. Clarity\nAccording to classification of ACLED event types in the codebook, there are three “General” categories and each category can be divided into several “Event type”. However, the original map only shows “Event Type”, without showing “General” groups. For this reason, readers cannot easily recognise the difference, in terms of severity of events.\n\neventTypeMark as a single dot: Every event is represented by single dot with different colors. However, if several events occured at the same place, it would be hard to count how many events were accured just by the map.\n\nTime: Also, single dots do not tell when the events occured. This map only shows the events occured between 2015 to 2020.\n\nlefthand“Count of Sheet1”: As seen below, “Count of Sheet1”, y-axis label is ambiguous, because readers do not know “Sheet1”. This label should be changed with proper name.\n\neventyaxis“Event Date”: As seen below, the label of x-axis, “Event Date”, does not properly represent meaning of values of x-axis. The x-axis value only represents the year and there is no information about the sepecific date.\n\neventyaxis2Title of line graph “Armed Conflict Event by Type”: This title does not represent the whole meaning of the chart because it also shows the trend by time.\n\n2.2. Aesthetics\nLocation of legend: The legend locats on the right side, so it’s hard to understand at a glance while mapping each of dot and the legend.\n\n - 2) Range of y axis: As seen below graph, the ranges of each event’s y-axis are not consistant. Readers will be confused when looking at the graph because there the numbers are not uniform. The values should be compared up and down each of the graph.\neventyaxis2Color of line chart: As seen above, all the line graphs have the same color regardless of the event type.\n\nCountry name on the map: When readers select a country, country’s name is disappear due to many dots. Country names should be recognized more clearly on the map.\n\nlefthand2.3. Interactive\nTool tip for a dot: When readers hover over to the dots, only four information appeared in a form of tool tip. However, more valueable information should be popped up for readers. Especially, latitude and longitude are not very helful for readers.\n\ninteractive1Tool tip for a line graph: When readers hover over to the line graph, only three information appeared in a form of tool tip. As described above, more valueable information should be popped up for readers. Especially, “Event Type” and “Year of Event Date” are redundant because these values can easily find in y-axis and x-axis in a graph.\n\ninteractive2Radio button for selection of country: In order to compare data by countries, legend(filter) should be changed from radio button to check box.\n\ninteractive33. Alternative suggestion of the graph\n3.1. Sktechs of graphical presentation and advantages\n1) Sketch1 - Dashboard\n2) Sketch2 - Tooltips\n3.2. Final dashboard of visualisation using Tableau.\nAll the charts we designed above were rearranged for one cleaned dashboard.\n\nFinal Dashboard\n4. Step-by-step preparation of visualization\n4.1. Upload raw data set in Tableau\nUpload raw data “Southeast-Asia_2010-2020_Oct31.xlsx” into Tableau “Data Source”.\n\n4.2. Make necessary fields clean and transform for analysis\nMove up “Latitude” and “Longitude” filed from Measure pannel to Attribute pannel.\n\nCreate a Hierachy “Region”, “Country” and “Adminn1” field for geospatial analysis.\n\nMake sure to change ’Admin1\" field type to “Geographic Role” > “State/Province”.\n\nCreate a group for aggregate “Event Type” for further analysis\".\n\n\n4.3. Create Map chart to show geospatial analysis\nPut all necessary fields into Pannel as below.\n\nPut “Country”, “Event Tpye”, and “Year”. Then click “Show Filter” to see in the filter pannel\n\nGo to legend area and change title of “Event Type” legend\n\nGo to “Year” legend and click small triangle right corner, then click “Single Value (slider)”\n\nGo to Tool tip menu in “Marks” pannel and edti as below\n\n4.4. Create bar chart to show trend of number of events comapring by countries\nPut all necessary fields into Pannel as below.\n\nClick “Show Filter” to show in the filter pannel.\n\nRight click x-axis and click “Edit Axis” then delete “Title”.\n\nRight click label of columns, “Event Date”, and check “Hide Field Labels for Columns”\n\nGo to filter and change the legend title\n\nRight click title, “Sheet 2(2)” and check “Hide Title”\n\nSort “Country” by “CNT(sheet1)” field\n\nGo to filter pannel and click small triangle in “Year” filter. Then check “Multiple Values (dropdown)”\n\nChange order of “Event Type” by clicking “Sort” > “Manual” option.\n\n4.5. Create bar chart to show trend of number of fatalities comapring by countries\nDuplicate “No of Event” sheet we created above, and rename “No of Fatality”\n\nDrag and drop “Fatalities” measures onto “CNT(Sheet1)” to change the target value.\n\nAgain go to x-axis and right click. Then delete “Title”.\n\n4.6. Create tooltips for trend of number of events and fatalities\nDuplicate “No of Event” sheet we created above, and rename “No of Event_tooltip”\n\nClick “+” sign and extend fileds to “Month”\n\nDrag and drop all fields as below Then change graph type to “Line”\n\nDrag and drop “Event Type” and “CNT(Sheet(1))” onto “Label” in Marks. Click “Label” button and change setting as below.\n\nDuplicate above sheet and rename to “No of Fatality_tooltip”. Then change “CNT(Sheet1(1))” to “Fatality” in Rows.\n\nGo back to “No of Event” sheet and click “Tooltip”. Then type as below.\n\nGo back to “No of Fatality” sheet and click “Tooltip”. Then type as below.\n\n4.8. Create Dashboard\nPut all necessary fields into Pannel and readjust size of each chart as below.\n\nClick “More option” in “Year” filter and go to “Selected Worksheets…”\n\nCheck every worksheet as below.\n 4. Do the same action as above for “Event Type” filter in “1. The number of armed conflict events and fatalities (Jan 2010 to Oct 2020)”\nOther filters in “2. Location and the number of armed conflict events (Jan 2010 to Oct 2020)” do not need to change filter setting.\n\n\n\n",
    "preview": {},
    "last_modified": "2021-03-20T17:42:54+08:00",
    "input_file": "Assignment3.utf8.md"
  },
  {
    "path": "posts/2021-02-25-visual-analytics-project-proposal/",
    "title": "Visual Analytics Project Proposal",
    "description": "Understanding Key Stories Covered In the Media and How Readers Engaged With News",
    "author": [
      {
        "name": "Atticus Foo, Gerald Chee & Nam Jihun",
        "url": "https://public.tableau.com/profile/atticusfoo#!/"
      }
    ],
    "date": "2021-02-25",
    "categories": [],
    "contents": "\n\nContents\n1. Motivations and Objective\n2. Data\n3. Visualisation Features\n3.1 Topic Classification\n3.2 Time Series Analysis\n3.3 Anomaly Detection\n\n4. Challenges\n4.1 Classifying unstructured data\n4.2 Data cleaning for unstructured data\n\n5. Annex – proposed sites for analysis\n\nProject Proposal1. Motivations and Objective\nAs we become more and more inundated with news from various digital sources today, understanding what the key stories are across the digital spectrum is becoming more and more challenging. As such, we are interested in understanding how to best present a visual snapshot of the key stories that are covered in local media and identifying how readers engaged with the news.\n2. Data\nTo do this, we will be analysing English news articles published by 9 local news sites for the year of 2020. To identify how readers engaged with each article, we will be using Facebook engagement data (Likes, Shares and Comments) retrieved from CrowdTangle and Prrt. This amounts to 94,841 news articles and its corresponding Facebook engagement data.\n3. Visualisation Features\nWe plan to feature three visualisation modules: - Topic Classification in order to understand key news topics - Time series analysis in order to identify current trends and forecast future ones - Anomaly detection in order to detect key news items\n3.1 Topic Classification\nTopic ClassificationTopic classification could be the most challenging as it would require text analytics. This is due both to our unfamiliarity with text analytics as well as the localised nature of our news headlines – even if it is in the English language.\n3.2 Time Series Analysis\nTime Series AnalysisAs we will be looking at an entire year’s worth of data, we should be able to statistically quantify past trends. Using this, we should also be able to forecast future trends, such as predicting the most popular days for news engagement.\n3.3 Anomaly Detection\nAnomaly DetectionAs it is important to quickly sift through all the noise to identify news trends, we propose building an anomaly detection visualisation that could present articles that have gone viral. This can be done by identifying if there are engagement rates that have fallen outside the norm.\n4. Challenges\nAt this current stage, we foresee two main challenges for this project. They are:\n4.1 Classifying unstructured data\nMuch of the project relies on being able classify article headlines for further statistical analysis. As identified above, this is our biggest challenge. Dealing with unstructured data will be difficult especially since the team is unfamiliar with text analytics.\nThis will be made tougher as the localised nature of news headlines from local media will mean that we will have less libraries and resources to call upon online.\n4.2 Data cleaning for unstructured data\nThe unstructured nature of the data will also present a second challenge for data cleaning. As much of the data is taken from public scrappers, and Facebook metadata, we have to ensure that there are no duplicates in values as well as odd text in the dataset.\n5. Annex – proposed sites for analysis\nAsia One\nChannel News Asia\nMothership\nMust Share News\nRice Media\nStraits Times\nThe Online Citizen\nToday Online\nYahoo SG\n\n\n\n",
    "preview": {},
    "last_modified": "2021-02-25T14:21:42+08:00",
    "input_file": "visual-analytics-project-proposal.utf8.md"
  },
  {
    "path": "posts/2021-02-19-Assignment2/",
    "title": "ISSS608 AY2020-21_T2 Visual Analytic DataViz Makeover2",
    "description": "Description: Visualisation and analysis of willingness of the public on Covid-19 vaccination",
    "author": [
      {
        "name": "Jihun NAM",
        "url": {}
      },
      {
        "name": "",
        "url": {}
      }
    ],
    "date": "2021-02-19",
    "categories": [],
    "contents": "\n1. Overview\nThis post will show how to visualise the result of surveys regarding how people think about Covid-19 vaccination around the world. The original data can be found at Imperial College London YouGov Covid 19 Behaviour Tracker Data Hub Firstly, we will criticize the original charts then show how to make better visualization from the same data set.\nOriginal chart\nFigure0 : Original visualisationIn this GitHub page, below information and data files were used for analysis.\nREADME.md\ncodebook of the core questionnaire codebook.xlsx\nlist of countries with data countries.csv\nindividual country files with respondent-level data data/country-name.csv\n2. Critique of the original charts\n2.1. Clarity\n\nThis chart is a visualisation for a question “If a Covid-19 vaccine were made available to me this week, I would definitely get it”. However, the title of this only show the answer of the question. We need to show proper title to clarify the result.\nThis chart is sorted by country name in alphabetical order. Users cannot figure out which country is more pro-vaccine.\nUsers cannot tell which country is most pro-vaccine or not because the results are visualised using 100% stack bars. It is difficult to show using stack bars, because users should compare all the sizes and values line by line.\nThere is no indicator to compare and sort. We need to create a new value to compare among countries properly.\nThere is a typo error in the title ‘pro-vacinne’. It need to be changed to ‘pro-vaccine’.\n“% of Total Record”, the title of x-axis should be changed to “Percentage of Total Reocrd”\n\nAs we seen above, this chart also regarding a question “If a Covid-19 vaccine were made available to me this week, I would definitely get it”. However, the title of this only show the answer of the question. We need to show proper title to clarify the result.\nWith this chart, we cannot see how many of respondents replied to the survey. Therefore, it is hard to say that percent of people in Sweden is higher than that in Canada, in terms of Confidence interval. We need to show the total number of respondents by country to show the result for clarity.\n2.2. Aesthetics\n\nThis chart used 5 different color to show the proportion of each answer. However, the colors are not consistent to show the scale of answers. We need to use the color scheme wisely, grouping the similar sentiment\nAll the countries have lowercase letters. We need to change first letter of country name.\n\nWe can see a number of countries in a form of bar chart with white background color, so it is not easy to compare by countries. We need to shade each rows to differentiate results.\nThe numbers in x-axis have decimal point. We can eliminate all decimal points which are not needed.\n\nThe title of legend is not appropriate, because users cannot understand properly with ‘Vac 1’.\nThe legend for the charts only shows the scale of 1 and 5. To make the legend clearer, we need to show all the proper title of the legend\n3. Alternative suggestion of the graph\n3.1. Sktechs of graphical presentation and advantages\n1) Sketch1 - Dashboard\nAfter finding several issues in clarity and aesthetic, we can design a new dashboard to show the survey result clearly. Below the left side chart clearly shows that average scores of answers comparing countries. Also the right side chart clearly shows that not only the percentage of respondents “strongly agreed” to a question, but also confidence interval ranges.\nNote that in final dashboard, we will add the total number of respondents by country next to the “% of strongly agreed to vaccination” chart.\nAs seen below, we can put question filter upper position so that users can easily see what about the chart trying to show. Also we can locate legend of “Answer” and “Scale of answer” to show users to see easily.\n\n2) Sketch2 - Tooltips\nThe dataset contains several important attributes, such as gender, age, answered week, and employment status. Below charts are also important that show how the answers are organised. These charts will be displayed when the you hover over to the previous dashboard graph.\nBy showing the detailed answers by different sub-categories, users can understand easily which factors were affected to the results.\nAlso, we can add ‘Average score’ through the chart to compare easily by the sub-categories.\nLastly, we can also include exact numbers of the results, which are hard to show in main dashboard due to space limitation.\n\n3.2. Final dashboard of visualisation using Tableau.\nAll the charts we designed above were rearranged for one cleaned dashboard\n\n4. Step-by-step preparation of visualization\n4.1. Preparation for data sets\nSome individual country files are compressed, so you have to decompress them in csv format.\n4.2. Upload raw data set in Tableau\nAfter decompressing all files, data sets are needed to be imported to Tableau.\nIn order to union all the 30 individual country csv files, you need to remove pre-set data set(germany.csv). Then, drag and drop “New Union” to the pane. Next, select all the csv files on the next and drag into the dialog box.\n\nFor the purpose of the analysis, we need to hide unnecessary fields first. Click “Manage Metadata” button then select unnecessary fields. Next, right click and hit “Hide”. Leave required fields only as below.\n\nChange name of field of “Table Name” to “Country”. Then click “Aliases” and exclude ‘.csv’. in all Values on the right side.\n\nAfter changing all the name of fields regarding questions, select all the six question fields and right click to pivot the values.\n\nThen change pivoted fields’ name to “Question” and “Score”.\n\nClick “Create Group..” in “Age” field. Select all the age instances that you want to group and click “Group” button.\n\nGo to Sheet1 and drag and drop “Score” into “Filters” pane. Un-check Null values in Score because the values are not necessary to visualise.\n\nClick “Analysis” > “View data” menue and click “Extract All” to get necessary data.\n\n4.3. Upload cleaned data set in Tableau and create necessary calculated fields for analysis\nOpen new tableau file and connect to the extracted file created above.\nCreate “Answer” field using “created calculated field” function as below. By using letters not digits, users may not be confused easily.\n\nIt is more intuitive to express positive responses in high numbers. So, change all the score values in reverse order, using “created calculated field” function\n\n4.4. Create gantt chart to show the survey results\nWe need to make a chart so that we can easily recognize the results of the survey at a glance. In order to compare the proportion of respondents easily, we can divide axes and compare them at the same time.\nCreate “Negative Score Values” field, using “created calculated field” function. Note that you should use CNT to calculate the whole number of respondents.\n\nCreate “Total Negative Scores” field using “created calculated field” function. You should click “Default Table Calculation” menu and change “Comute using” from Automatic to Answer.\n\nCreate “Total Score” field using “created calculated field” function and click “Default Table Calculation” then change Compute using to “Answer”.\n\nCreate “Gantt Start Point” field using “created calculated field” function.\n\nClick “Gantt Start Point” field and click Compute Using to Answer\n\nCreate “Percentage” field using “created calculated field” function to visualise the size of the gantt chart\n\nCreate “Gantt Percentage” field using “created calculated field” function and click “Default Table Calculation” then change Compute using to “Answer”.\n\nDrag and drop “Gantt Percetage” field into Columns and “Country” into Rows. Also Drag and drop “Answer”.\n\nDrag and drop “Question” field into “Filter” pane and change the Marks to “Gantt Bar”. Lastly, Drag and drop “Percentage” field onto “Size” button to show the percentage of respondents.\n\nClick “Answer” field and “Sort” menu. Check “Manually” in “Sort by” menu and change the order as below\n\nCreate “Avg Score” field using “created calculated field” function. Note that you should use “CNT” field to calculate sum of respondents.\n\nChange the Gantt chart color\n\nChage Marks to “Circle” and drag and drop “Avg Score” onto “Label” button. Then click and change “Compute using” to cell\n\nClick lable and change Font format and alignment as below\n\nClick “Avg Score” in Columns and check “Dual Axis” \nRight click above axis and click “Edit axis”. Check “Fixed” range for changing the range of axis from 1 to 5\n\nAfter changing Size of Circle chart and color to “White”\n\nAdd reference to show “0%” more clearly\n\nAdd reference to show “Average line”. Type label “ Score = ”\n\nThe final Gantt chart! \n4.5. Create Confidence Interval chart\nThe number of respondents are different among countries. Therefore, we cannot confidently say that the average scores of answers we have created above reflect correctly the opinion of whole country. For this reason, we can show the “confidence interval range” to give the better information to users. Based on the formula, when the number of sample increases, the range of confidence interval shorten.\n\nFirst of all, we need to create 7 calculated field to visualise confidence level. The formula for the fields are below.\n\n\n1.. (CI) No of Strongly agree\nIF [Answer]=“Strongly agree” THEN [CNT] ELSE 0 END\n\n\n2.. (CI) % of Strongly agree\nSUM([(CI) No of Strongly agree])/SUM([CNT])\n\n\n3.. (CI) Z_95%\n1.959964\n\n\n4.. (CI) Prop_SE\nSQRT(([(CI) % of Strongly agree]*(1-[(CI) % of Strongly agree]))/SUM([CNT]))\n\n\n5.. (CI) Prop_margin of Error 95%\n[(CI) Z_95%]*[(CI) Prop_SE]\n\n\n6.. (CI) Prop_Upper Limit 95%\n[(CI) % of Strongly agree] + [(CI) Prop_margin of Error 95%]\n\n\n7.. (CI) Prop_Lower Limit 95%\n[(CI) % of Strongly agree] - [(CI) Prop_margin of Error 95%]\n\nDrag and drop “(CI) % of Strongly agree” field into Columns and “Country” into Rows\n\nDrag and Drop “(CI) Prop_Lower Limit 95%” and “(CI) Prop_Upper Limit 95%” fields onto the column axis.\n 4. Change Measure Values graph to “Line” and click left button and change to “Path”\n\nRight click on the upper axis and check “Synchronize Axis”\n\nClick “Contry” in Rows and check “Sort” to sort Descending order by “(CI) % of Strongly agree”.\n\nAdd reference line to show average of “(CI) % of Strongly agree” over the countries.\n\nAdd tooltip to show the detail figures\n\nCreate a new worksheet for showing total number of respondents by country. Drag and drop “Country” field into Rows and “CNT” onto “Label” button. Also change the color shading to make clearer.\n\nClick “Country” field to sort by “(CI) % of Strongly agree”\n\n4.6. Create tooltip charts for showing detail of answers\nChanges of answers through weeks\nDrag and drop “Qweek” into Columns and “Avg Score” into Rows. In order to show the figures, put “Avg Score” onto “Color” and “Label” button in Marks\nChange chart format to “Line”\nAdd reference line to show the average value of “Avg Score” through week\n\nAnswers by Gender\nDrag and drop “Gender” into Columns and “Avg Score” into Rows. In order to show the figures, put “Avg Score” onto “Color” and “Label” button in Marks.\nChange chart format to “Bar”\nAdd reference line to show the average value of “Avg Score” through gender\n\nAnswers by Age\nDrag and drop “Age (Group)” into Columns and “Avg Score” into Rows. In order to show the figures, put “Avg Score” onto “Color” and “Label” button in Marks.\nChange chart format to “Bar”\nAdd reference line to show the average value of “Avg Score” through age group\n\nAnswers by Employ Status\nDrag and drop “Employ Status” into Columns and “Avg Score” into Rows. In order to show the figures, put “Avg Score” onto “Color” and “Label” button in Marks.\nChange chart format to “Bar”\nAdd reference line to show the average value of “Avg Score” through Employ Status\n\n\nAnswers by Household Children\nDrag and drop “Household Children” into Columns and “Avg Score” into Rows. In order to show the figures, put “Avg Score” onto “Color” and “Label” button in Marks.\nChange chart format to “Bar”\nAdd reference line to show the average value of “Avg Score” through Household Children\n\n\nDetailed figures for Country_gantt chart\nDuplicate “Country_gantt chart” worksheet\nRemove “AGG(Avg Score)” field in Columns\nDrag and drop “Percentage” field on “Label” button\n\nshow all tooltip charts when hover over to the “Country_gantt chart”\nGo back to “Country_gantt chart” worksheet we made ealier, and click Tooltip button in “Marks” > “All”\nIn order to show all the detailed charts, type as below\n\n4.7. Create Dashboard\nClick Dashboard icon and change Size to “Automatic”\n\nDrag and drop “A Text” object to the pane\n\n\nDrag and drop “CI_Chart” and “Country_gantt” on the pane side by side\n\nMove “Select question” filter and “Answer” legend above the two charts\n\nClick triangle and check “Single Value (dropdown)”\n\nDrag and drop “A Text” object below the “Answer” legend. then type below\n\nAdjust sizes of boxes we put\n\nDrag and drop more “A Text” objects between “Answer” label box and chart. Then type titles repectively.\n\nDrag and drop “CI_chart_respondents” next to “CI_chart”.\n\nThe final Dashboard\n\n5. Major observations\n5.1. People in EU are more likely to get vaccination comapred to that in Asia\nIf we see below dashboard we made earlier, average scores of the survey answer to “Q1. if a Covid-19 vaccine were made available to me this week, I would definitely get it” are varied by country. If you see the charts closely, people in EU countries are more likely to get vaccine, almost above average socre value of 3.39\nEspecially, the average scores of answer in United Kingdom is higher than that in Japan by 0.9.\nAlso, UK and Denmark people are more likely think that they strongly want to get vaccine if they are available.\n\n5.2. The older, the more agree to vaccination\nAs seen below, seniors (age group of 60-69) are more likely to get vaccine than relatively young group (age group of 30-39).\nAlso, this result can be seen if we see the chart of “Answers by Employ status”. The retired are likely to get vaccine than other groups.\n“Q1. if a Covid-19 vaccine were made available to me this week, I would definitely get it:”\n\n\n5.3. As times go by, people think more positively toward vaccine and government\nAs seen below, worries about potential side effects of vaccine are getting smaller.\nAlso, people believe their government health authorities more than before.\nQ3. I am worried about potential side effects of a COVID19 vaccine\n\nQ4. I believe government health authorities in my country will provide me with an effective COVID19 vaccine\n\nThe END\n\n\n\n",
    "preview": {},
    "last_modified": "2021-02-19T19:40:23+08:00",
    "input_file": "Assignment2.utf8.md"
  },
  {
    "path": "posts/2021-01-20-Assignment1/",
    "title": "ISSS608 AY2020-21_T2 Visual Analytic DataViz Makeover1",
    "description": "Description: Visualisation and analysis of MOM(Manpower Research and Statistics Department) Report on Labour Force in Singapore 2019",
    "author": [
      {
        "name": "Jihun NAM",
        "url": {}
      },
      {
        "name": "",
        "url": {}
      }
    ],
    "date": "2021-01-28",
    "categories": [],
    "contents": "\n1. Overview\nThe Report on Labour Force in Singapore is an annual report on Singapore’s labour market and it analyses diverse facets of Singapore’s labour force. In this post, the chart 6 “Resident labour force by age) in the original report will be evaluated in terms of”clarity\" and “aesthetics”. Then an alternative graphical presentation that represents more easier to understand the context will be presented and discussed.\nOriginal chart\nFigure0 : Original visualisationThe original source of the data can be found on page 22 of report: Report: Labour Force in Singapore 2019\nThe data is available at https://stats.mom.gov.sg/Pages/Labour-Force-Tables2019.aspx, and below three datasets were used for analysis.\nTable2: Key Characteristics of Resident Labour Force, 2009 - 2019 (June)\nTable5: Resident Labour Force Participation Rate by Age and Sex, 2009 - 2019 (June)\nTable7: Resident Labour Force Aged Fifteen Years and Over by Age and Sex, 2009 - 2019 (June)\n2. Critiques of the graph\n2.1. Clarity\n1) Missing graphs for illustration\nThe explanation above this chart illustrates four big things: (1) the share of residents population, (2) LFPR(Labour Force Prticipation Rate), (3) share of resident labour force, (4) Median age of residents. However, information of (3) and (4) is displayed in the chart and other two are merely stated in words.\nEspecially, (1) the share of residents population by age is mentioned only with footnotes, so it is difficult to understand and match the other data. Also, LFPR graph is not shown in this chart, so understanding the trend of changes of LFPR is difficult.\n2) Missing data for comparison\nTo compare the data accurately, all the data sets should be ready for use. Closely looking into LFPR data set (Table 5), LFPR of 55 & over age group data does not exist. Therefore, we cannot use the figures of 55 & over age group to compare with the share of residents population. To make all the data sets in the same format, the share of residents population data set should be divided into four age groups, 15-24, 25-54, 55-64, and 65&over.\n3) Inappropriate usage of graph\nThe median age of residents data between two years(2009 and 2019) are being displayed with dotted lines. However, because the figures of median age are continuous values, putting the dotted lines on categorical variables (age groups) is inappropriate.\n2.2. Aesthetics\n1) Selection of graph\nIn this chart, line graphs are used to show changes of the share of resident labour force by age. However, it is hard to understand how amounts of the share among the age groups were changed.\n2) Highlighting of important message\nIn order to make readers understand easier, at least this chart needs to highlight important figures to deliever clearer message.\nEven the table bellow the line graphs show that the figures of the share of each age group, readers can not easily sum up the figures to evaluate the differences between two fiscal years.\n3) Labelling and captions\n“June 20xx” labels are inserted multiple times unnecessarily. The duplicated labels can be removed to make the chart much simpler.\n“Per Cent” caption should be placed within the graph.\n“Source” and “Note” bellow the charts are not aligned, in terms of format.\n3. Alternative suggestion of the graph\n3.1. Sktechs of graphical presentation and advantages\n1) Sketch1 - The share of residents population\nThe first key message to convey is the change in the share of residents population. Bellow box plot clearly shows that the changes in shares of resident population among the age groups and between two years(2009 and 2019).\nFigure1 : Sketch12) Sketch2 - LFPR by age\nIn addition, the second key message to deliver is the change in LFPR (Labour Force Participation Rate). Bellow box plot also clearly displays the changes in LFPR among the age groups and between two years.\nFigure2 : Sketch23) Sketch3 - The share of resident labour force\nThe chart bellow Figure3 represents the portion of changes of the share of resident labour force between 2009 and 2019.\nFigure3 : Sketch34) Sketch4 - Median age of residents\nThe change of median age of residents in the labour force between 2009 and 2019 can be shown clearer with line graph.\nFigure4 : Sketch43.2. Final dashboard of visualisation using Tableau.\nAll the charts we designed above were rearranged for one cleaned dashboard Figure5 : Final Dashboard\n4. Step-by-step preparation of visualization\n4.1. Preparation for data sets\nData set\nSource\n1) Resident labour force participation rate by age\nTable5 (Resident Labour Force Participation Rate by Age and Sex, 2009 - 2019 (June))\n2) The share of resident labor force\nTable7 (Resident Labour Force Aged Fifteen Years and Over by Age and Sex, 2009 - 2019 (June))\n3) The share of residents population by age\nTable7 and Table5 are used for counter-calculation. The population figures are calculated by dividing “Resident labour force(Table7)” by “Resident labour force participation rate(Table5)”\n4) The Median age of labour force\nTable2 (Key Characteristics of Resident Labour Force, 2009 - 2019)\n4.2. Upload integrated data set in Tableau\nAfter pivoting and merging all the data sets using excel, the integrated data set is imported via Tableau\nFigure6 : integrated dataset4.3. Creating charts\nNext, Tableau’s Polaris was used to create the charts\n1) Creating chart of the share of residents population and chart of LFPR by age\nFigure7 : Share of residents population and LFPR by age\nAfter adding Category, Age, and Year to Columns, drag and drop Percent(: attribute name of all the figures) to Rows.\nAdd Age to Filters and check 15-24, 25-54, 55-64, and 65&over.\nDrag and drop Year to Marks > Color and change Marks type from Automatic to Bar.\nIn order to show the differnces between 2009 and 2019 values, drag and drop Percent to Rows and change Marks type to Line. Then select dual axis to combine both charts.\nIn Marks > SUM(Percent)(2), exclude Year from color and click Color to change line’s color (to red).\nDrag and drop Percent to Label to show the values.\n\n2) Creating the chart of the share of resident labour force\nFigure8 : Share of residents Labour force by age\nAfter adding Age to Columns, drag and drop Percent to Rows.\nAdd Category and check “Share of the labour force” only.\nChange Marks type to Area and click Analysis > Stack Marks > Off.\nDrag and drop Year to color to differentiate between two years.\nCreate a new calculated field named Gaps and type {Exclude [Year]: MIN([Percent]) }.\nAdd Gaps to Rows then select dual axis to combine with previous chart.\nClick Marks>color and change Gaps to White with 100% opacity.\nAdd Percent to Rows again with Line graph then select dual axis.\n\nFigure9 : Share of residents Labour force by age (table)\nAfter adding creating the share of labour force worksheet, need to creat a new table to show the figures of each age group.\nDrag and drop Age to Columns and Year to Rows.\nClick Show Me to check Text Tables.\n\n3) Creating the chart of median age of residents\nFigure10 : Median age of residents\nDrag and drop Year to Columns and Percent to Rows.\nFillter Category and check Median only.\nHide and remain only 2009 and 2019 in x-axis.\n\n4) Creating dashboard merging whole charts\nFigure11 : Dashboard\nDrag and drop Objects>Text on top of the dashboard then type Title and descriptions.\nPut all the worksheets that we made on the dashboard and rearrange the size.\n\n5. Major observations\nLabour force in Singapore is aging\n5.1. Changes of the share of residents population\nAs illustrated in the statement in original chart, the share of senior population is getting larger than before. The share of residents aged 55-64 and 65&over rose from 14% (2009) to 17% (2019) and from 11% (2009) to 17%(2019), respectively. Whereas, the share of young age groups declined from 59% (2009) to 52% (2019). This fact affects to changes of the share of resident labour force consequently, because the working young population cohorts moving into the senior group.\n5.2. Changes of LFPR\nOverall LFPR (Labour Force Participation Rate) rose since 2009, however, among 55-64 and 65&over age group’s increments were relatively huge than 25-54 age cohort. Especially, 65&over cohort’s fluctuation was norteworthy, which means that more seniors take part in work activity than 10 years ago. Also, we can assumes that the fact of big changes of LFPR affects to the share of resident labour force.\n5.3. Changes of the share of resident labour force\nConsequently, this whole report and charts were written to explain that Labour force in Singapore is aging. As seen in the dashboard, 9.1% of the shares of resident labour force in aged 55&over, orange colored part in Figure3, rose from 2009 to 2019. As a result, median age of residents in the labour force rose from 41 years in 2009 to 44 years in 2019.\nThe END\n\n\n\n",
    "preview": {},
    "last_modified": "2021-02-18T08:41:52+08:00",
    "input_file": "Assignment1.utf8.md"
  },
  {
    "path": "posts/2021-01-20-MarkDown-Guide/",
    "title": "MarkDown Guide",
    "description": "This is MarkDown Guide",
    "author": [
      {
        "name": "Jihun NAM",
        "url": "https://github.com/jeerohoon"
      }
    ],
    "date": "2021-01-20",
    "categories": [],
    "contents": "\nFirst Level Header\ncontent\nSecond Level Header\ncontent\nThis is a first thing\nThis is a second thing\nThis is a third thing\nbullet one\nbullet two\nbullet three new content1 new content2 > Blockquotes\nOfficial Guide Link\nYou can insert links like this https://www.markdownguide.org/basic-syntax/.\nOr you can insert links like this my website.\nOr you can insert links with caption like this my website.\nOr link for official guide https://www.markdownguide.org/basic-syntax/\nImportant Features\nEmphasis\nBold To bold text, add two asterisks or underscores before and after a word or phrase. To bold the middle of a word for emphasis, add two asterisks without spaces around the letters.\nI just love bold text.\nI just love bold text.\nItalic To italicize text, add one asterisk or underscore before and after a word or phrase. To italicize the middle of a word for emphasis, add one asterisk without spaces around the letters.\nItalicized text is the cat’s meow.\nItalicized text is the cat’s meow.\nAcatmeow\nBold and Italic To emphasize text with bold and italics at the same time, add three asterisks or underscores before and after a word or phrase. To bold and italicize the middle of a word for emphasis, add three asterisks without spaces around the letters.\nThis text is really important.\nThis text is really important.\nThis text is really important.\nThis text is really important.\nThis is reallyveryimportant text.\nEmphasis\nBlockquotes To create a blockquote, add a > in front of a paragraph.\n\nDorothy followed her through many of the beautiful rooms in her castle.\n\nBlockquotes with Multiple Paragraphs Blockquotes can contain multiple paragraphs. Add a > on the blank lines between the paragraphs.\n\nDorothy followed her through many of the beautiful rooms in her castle.\nThe Witch bade her clean the pots and kettles and sweep the floor and keep the fire fed with wood.\n\nNested Blockquotes Blockquotes can be nested. Add a >> in front of the paragraph you want to nest.\n\nDorothy followed her through many of the beautiful rooms in her castle.\n\nThe Witch bade her clean the pots and kettles and sweep the floor and keep the fire fed with wood.\n\n\nBlockquotes with Other Elements Blockquotes can contain other Markdown formatted elements. Not all elements can be used — you’ll need to experiment to see which ones work.\n\nThe quarterly results look great!\nRevenue was off the chart.\nProfits were higher than ever.\nEverything is going according to plan.\n\nImages\nFrom image file To add an image, add an exclamation mark (!), followed by alt text in brackets, and the path or URL to the image asset in parentheses. You can optionally add a title after the URL in the parentheses.\nTest image!From link To add a link to an image, enclose the Markdown for the image in brackets, and then add the link in parentheses.\n\nReference-style Links\nReference-style links are a special kind of link that make URLs easier to display and read in Markdown. Reference-style links are constructed in two parts: the part you keep inline with your text and the part you store somewhere else in the file to keep the text easy to read.\nIn one example, researchers studied the covid Bastard et al. (2020). COVID (2020)\nReferences\n\n\n\nBastard, Paul, Lindsey B. Rosen, Qian Zhang, Eleftherios Michailidis, Hans-Heinrich Hoffmann, Yu Zhang, Karim Dorgham, Quentin Philippot, Jérémie Rosain, and Vivien Béziat. 2020. “Autoantibodies Against Type I IFNs in Patients with Life-Threatening COVID-19.” Science 370 (6515).\n\n\nCOVID, Team CDC. 2020. Characteristics of Health Care Personnel with COVID-19-United States, February 12-April 9, 2020.\n\n\n\n\n",
    "preview": {},
    "last_modified": "2021-03-17T22:04:30+08:00",
    "input_file": "MarkDown-Guide.utf8.md"
  },
  {
    "path": "posts/2021-01-04-my-first-post/",
    "title": "My first post",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "Jihun NAM",
        "url": "https://github.com/jeerohoon"
      }
    ],
    "date": "2021-01-04",
    "categories": [],
    "contents": "\n1.0 Overview\nCorrelation coefficient is a popular statistic that use to measure the type and strength of the relationship between two variables. The values of a correlation coefficient ranges between -1.0 and 1.0. A correlation coefficient of 1 shows a perfect linear relationship between the two variables, while a -1.0 shows a perfect inverse relationship between the two variables. A correlation coeficient of 0.0 shows no linear relationship between the two variables.\nWhen multivariate data are used, the correlation coeficeints of the pair comparisons are displayed in a table form known as correlation matrix or scatterplot matrix.\nThere are three broad reasons for computing a correlation matrix.\nTo reveal the relationship between highdimensional variables pairwisely.\nTo input into other analyses. For example, people commonly use correlation matrixes as inputs for exploratory factor analysis, confirmatory factor analysis, structural equation models, and linear regression when excluding missing values pairwise.\nAs a diagnostic when checking other analyses. For example, with linear regression a high amount of correlations suggests that the linear regression’s estimates will be unreliable.\nWhen the data is large, both in terms of the number of observations and the number of variables, Corrgram tend to be used to visually explore and analyse the structure and the patterns of relations among variables. It is designed based on two main schemes:\nRendering the value of a correlation to depict its sign and magnitude, and\nReordering the variables in a correlation matrix so that “similar” variables are positioned adjacently, facilitating perception.\nIn this hands-on exercise, you will learn how to plot data visualisation for visualising correlation matrix with R. It consists of three main sections. First, you will learn how to create correlation matrix using pairs() of R Graphics. Next, you will learn how to plot corrgram using corrplot package of R Lastly, you will learn how to create an interactive correlation matrix using plotly R. .\n2.0 Installing and Launching R Packages\nBefore you get started, you are required:\nto start a new R project, and\nto create a new R Markdown document.\nNext, you will use the code chunk below to install and launch corrplot, ggpubr, plotly and tidyverse in RStudio.\n\n\npackages = c('ggpubr', 'tidyverse')\n\nfor(p in packages){library\n  if(!require(p, character.only = T)){\n    install.packages(p)\n  }\n  library(p, character.only = T)\n}\n\n\n\n3.0 Importing and Preparing The Data Set\nIn this hands-on exercise, the Wine Quality Data Set of UCI Machine Learning Repository will be used. The data set consists of 13 variables and 6497 observations. For the purpose of this exercise, we have combined the red wine and white wine data into one data file. It is called wine_quality and is in csv file format.\n3.1 Importing Data\nFirst, let us import the data into R by using read_csv() of readr package.\n\n\nwine <- read_csv(\"data/wine_quality.csv\")\n\n\n\nNotice that beside quality and type, the rest of the variables are numerical and continuous data type.\n4.0 Univariate EDA with Histogram\nIn the figure below, multiple histograms are plottted to reveal the distribution of the selected variables in the wine quality data sets.\n\n\n\nThe code chunks used to create the data visualisation consists of two main parts. First, we will create the individual histograms using the code chunk below.\n\n\nfa <- ggplot(data=wine, aes(x= `fixed acidity`)) +\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\nva <- ggplot(data=wine, aes(x= `volatile acidity`)) +\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\nca <- ggplot(data=wine, aes(x= `citric acid`)) +\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\nrs <- ggplot(data=wine, aes(x= `residual sugar`)) +\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\nch <- ggplot(data=wine, aes(x= `chlorides`)) +\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\nfSO2 <- ggplot(data=wine, aes(x= `free sulfur dioxide`)) +\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\ntSO2 <- ggplot(data=wine, aes(x= `total sulfur dioxide`)) +\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\ndensity <- ggplot(data=wine, aes(x= density)) +\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\npH <- ggplot(data=wine, aes(x= pH)) +\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\nsulphates <- ggplot(data=wine, aes(x= sulphates)) +\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\nalcohol <- ggplot(data=wine, aes(x= alcohol)) +\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\n\n\n\nNext, the ggarrange function of ggpur package is used to group these histograms together.\n\n\nggarrange(fa, va, ca, rs, ch, fSO2, tSO2, density, pH, sulphates, alcohol, \n          ncol = 4, nrow = 3)\n\n\n\n\n\n\n",
    "preview": "posts/2021-01-04-my-first-post/my-first-post_files/figure-html5/unnamed-chunk-3-1.png",
    "last_modified": "2021-01-28T13:16:04+08:00",
    "input_file": "my-first-post.utf8.md"
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to IDEA",
    "description": "Welcome to our new blog, IDEA. We hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "Jihun NAM",
        "url": "https://github.com/jeerohoon"
      }
    ],
    "date": "2021-01-04",
    "categories": [],
    "contents": "\n\n\n\n",
    "preview": {},
    "last_modified": "2021-01-04T20:59:41+08:00",
    "input_file": {}
  }
]
