[
  {
    "path": "posts/2021-02-19-Assignment2/",
    "title": "ISSS608 AY2020-21_T2 Visual Analytic DataViz Makeover2",
    "description": "Description: Visualisation and analysis of willingness of the public on Covid-19 vaccination",
    "author": [
      {
        "name": "Jihun NAM",
        "url": {}
      },
      {
        "name": "",
        "url": {}
      }
    ],
    "date": "2021-02-19",
    "categories": [],
    "contents": "\n1. Overview\nThe data\nOriginal chart\nFigure0 : Original visualisationThe original source of the data can be found at Imperial College London YouGov Covid 19 Behaviour Tracker Data Hub\nIn this GitHub page, below information and data files were used for analysis.\nREADME.md\ncodebook of the core questionnaire codebook.xlsx\nlist of countries with data countries.csv\nindividual country files with respondent-level data data/country-name.csv\n2. Critiques of the graph\n2.1. Clarity\nspelling bistake: vaccination\n1) Missing graphs for illustration\nThe explanation above this chart illustrates four big things: (1) the share of residents population, (2) LFPR(Labour Force Prticipation Rate), (3) share of resident labour force, (4) Median age of residents. However, information of (3) and (4) is displayed in the chart and other two are merely stated in words.\nEspecially, (1) the share of residents population by age is mentioned only with footnotes, so it is difficult to understand and match the other data. Also, LFPR graph is not shown in this chart, so understanding the trend of changes of LFPR is difficult.\n2) Missing data for comparison\nTo compare the data accurately, all the data sets should be ready for use. Closely looking into LFPR data set (Table 5), LFPR of 55 & over age group data does not exist. Therefore, we cannot use the figures of 55 & over age group to compare with the share of residents population. To make all the data sets in the same format, the share of residents population data set should be divided into four age groups, 15-24, 25-54, 55-64, and 65&over.\n3) Inappropriate usage of graph\nThe median age of residents data between two years(2009 and 2019) are being displayed with dotted lines. However, because the figures of median age are continuous values, putting the dotted lines on categorical variables (age groups) is inappropriate.\n2.2. Aesthetics\n1) Selection of graph\nIn this chart, line graphs are used to show changes of the share of resident labour force by age. However, it is hard to understand how amounts of the share among the age groups were changed.\n2) Highlighting of important message\nIn order to make readers understand easier, at least this chart needs to highlight important figures to deliever clearer message.\nEven the table bellow the line graphs show that the figures of the share of each age group, readers can not easily sum up the figures to evaluate the differences between two fiscal years.\n3) Labelling and captions\n“June 20xx” labels are inserted multiple times unnecessarily. The duplicated labels can be removed to make the chart much simpler.\n“Per Cent” caption should be placed within the graph.\n“Source” and “Note” bellow the charts are not aligned, in terms of format.\n3. Alternative suggestion of the graph\n3.1. Sktechs of graphical presentation and advantages\n1) Sketch1 - Dashboard\nAfter finding several issues in clarity and aesthetic, we can design a new dashboard to show the survey result clearly. Bellow the left side chart clearly shows that average scores of answers comparing countries. Also the right side chart clearly shows that not only the % of strongly agreed to a certain answer, but also confidence interval ranges.\n\n2) Sketch2 - Tooltip\nThe dataset contains several important attributes, such as gender, week answered, and employment status. Bellow charts are also important that show how the answers are organised. These charts will be displayed when the you hover over to the previous dashboard graph.\n\n3.2. Final dashboard of visualisation using Tableau.\nAll the charts we designed above were rearranged for one cleaned dashboard Figure5 : Final Dashboard\n4. Step-by-step preparation of visualization\n4.1. Preparation for data sets\nSome individual country files are compressed, so you have to decompress them in csv format.\n4.2. Upload raw data set in Tableau\nAfter decompressing all files, data sets are needed to be imported to Tableau.\nIn order to union all the 30 individual country csv files, you need to remove pre-set data set(germany.csv). Then, drag and drop “New Union” to the pane. Next, select all the csv files on the next and drag into the dialog box.\n\nFor the purpose of the analysis, we need to hide unnecessary fields first. Click “Manage Metadata” button then select unnecessary fields. Next, right click and hit “Hide”. Leave required fields only as below.\n\nChange name of field of “Table Name” to “Country”. Then click “Aliases” and exclude ‘.csv’. in all Values on the right side.\n\nAfter changing all the name of fields regarding questions, select all the six question fields and right click to pivot the values.\n\nThen change pivoted fields’ name to “Question” and “Score”.\n\nClick “Create Group..” in “Age” field. Select all the age instances that you want to group and click “Group” button.\n\nGo to Sheet1 and drag and drop “Score” into “Filters” pane. Un-check Null values in Score because the values are not necessary to visualise.\n\nClick “Analysis” > “View data” menue and click “Extract All” to get necessary data.\n\n4.3. Upload cleaned data set in Tableau and create necessary calculated fields for analysis\nOpen new tableau file and connect to the extracted file created above.\nCreate “Answer” field using “created calculated field” function as below. By using letters not digits, users may not be confused easily.\n\nIt is more intuitive to express positive responses in high numbers. So, change all the score values in reverse order, using “created calculated field” function\n\n4.4. Create gantt chart to show the survey results\nWe need to make a chart so that we can easily recognize the results of the survey at a glance. In order to compare the proportion of respondents easily, we can divide axes and compare them at the same time.\nCreate “Negative Score Values” field, using “created calculated field” function. Note that you should use CNT to calculate the whole number of respondents.\n\nCreate “Total Negative Scores” field using “created calculated field” function. You should click “Default Table Calculation” menu and change “Comute using” from Automatic to Answer.\n\nCreate “Total Score” field using “created calculated field” function and click “Default Table Calculation” then change Compute using to “Answer”.\n\nCreate “Gantt Start Point” field using “created calculated field” function.\n\nClick “Gantt Start Point” field and click Compute Using to Answer\n\nCreate “Percentage” field using “created calculated field” function to visualise the size of the gantt chart\n\nCreate “Gantt Percentage” field using “created calculated field” function and click “Default Table Calculation” then change Compute using to “Answer”.\n\nDrag and drop “Gantt Percetage” field into Columns and “Country” into Rows. Also Drag and drop “Answer”.\n\nDrag and drop “Question” field into “Filter” pane and change the Marks to “Gantt Bar”. Lastly, Drag and drop “Percentage” field onto “Size” button to show the percentage of respondents.\n\nClick “Answer” field and “Sort” menu. Check “Manually” in “Sort by” menu and change the order as below\n\nCreate “Avg Score” field using “created calculated field” function. Note that you should use “CNT” field to calculate sum of respondents.\n\nChange the Gantt chart color\n\nChage Marks to “Circle” and drag and drop “Avg Score” onto “Label” button. Then click and change “Compute using” to cell\n\nClick lable and change Font format and alignment as below\n\nClick “Avg Score” in Columns and check “Dual Axis” \nRight click above axis and click “Edit axis”. Check “Fixed” range for changing the range of axis from 1 to 5\n\nAfter changing Size of Circle chart and color to “White”\n\nAdd reference to show “0%” more clearly\n\nAdd reference to show “Average line”. Type label “ Score = ”\n\nThe final Gantt chart! \n4.5. Create Confidence Interval chart\nThe number of respondents are different among countries. Therefore, we cannot confidently say that the average scores of answers we have created above reflect correctly the opinion of whole country. For this reason, we can show the “confidence interval range” to give the better information to users. Based on the formula, when the number of sample increases, the range of confidence interval shorten.\n\nFirst of all, we need to create 7 calculated field to visualise confidence level. The formula for the fields are below.\n\n\n1.. (CI) No of Strongly agree\nIF [Answer]=“Strongly agree” THEN [CNT] ELSE 0 END\n\n\n2.. (CI) % of Strongly agree\nSUM([(CI) No of Strongly agree])/SUM([CNT])\n\n\n3.. (CI) Z_95%\n1.959964\n\n\n4.. (CI) Prop_SE\nSQRT(([(CI) % of Strongly agree]*(1-[(CI) % of Strongly agree]))/SUM([CNT]))\n\n\n5.. (CI) Prop_margin of Error 95%\n[(CI) Z_95%]*[(CI) Prop_SE]\n\n\n6.. (CI) Prop_Upper Limit 95%\n[(CI) % of Strongly agree] + [(CI) Prop_margin of Error 95%]\n\n\n7.. (CI) Prop_Lower Limit 95%\n[(CI) % of Strongly agree] - [(CI) Prop_margin of Error 95%]\n\nDrag and drop “(CI) % of Strongly agree” field into Columns and “Country” into Rows\n\nDrag and Drop “(CI) Prop_Lower Limit 95%” and “(CI) Prop_Upper Limit 95%” fields onto the column axis.\n 4. Change Measure Values graph to “Line” and click left button and change to “Path”\n\nRight click on the upper axis and check “Synchronize Axis”\n\nClick “Contry” in Rows and check “Sort” to sort Descending order by “(CI) % of Strongly agree”.\n\nAdd reference line to show average of “(CI) % of Strongly agree” over the countries.\n\nAdd tooltip to show the detail figures\n\n4.6. Create tooltip charts for showing detail of answers\nChanges of answers through weeks\nDrag and drop “Qweek” into Columns and “Avg Score” into Rows. In order to show the figures, put “Avg Score” onto “Color” and “Label” button in Marks\nChange chart format to “Line”\nAdd reference line to show the average value of “Avg Score” through week\n\nAnswers by Gender\nDrag and drop “Gender” into Columns and “Avg Score” into Rows. In order to show the figures, put “Avg Score” onto “Color” and “Label” button in Marks.\nChange chart format to “Bar”\nAdd reference line to show the average value of “Avg Score” through gender\n\nAnswers by Age\nDrag and drop “Age (Group)” into Columns and “Avg Score” into Rows. In order to show the figures, put “Avg Score” onto “Color” and “Label” button in Marks.\nChange chart format to “Bar”\nAdd reference line to show the average value of “Avg Score” through age group\n\nAnswers by Employ Status\nDrag and drop “Employ Status” into Columns and “Avg Score” into Rows. In order to show the figures, put “Avg Score” onto “Color” and “Label” button in Marks.\nChange chart format to “Bar”\nAdd reference line to show the average value of “Avg Score” through Employ Status\n\n\nAnswers by Household Children\nDrag and drop “Household Children” into Columns and “Avg Score” into Rows. In order to show the figures, put “Avg Score” onto “Color” and “Label” button in Marks.\nChange chart format to “Bar”\nAdd reference line to show the average value of “Avg Score” through Household Children\n\n\nDetailed figures for Country_gantt chart\nDuplicate “Country_gantt chart” worksheet\nRemove “AGG(Avg Score)” field in Columns\nDrag and drop “Percentage” field on “Label” button\n\nshow all tooltip charts when hover over to the “Country_gantt chart”\nGo back to “Country_gantt chart” worksheet we made ealier, and click Tooltip button in “Marks” > “All”\nIn order to show all the detailed charts, type as below\n\n4.7. Create Dashboard\nClick Dashboard icon and change Size to “Automatic”\n\nDrag and drop “A Text” object to the pane\n\n\nDrag and drop “CI_Chart” and “Country_gantt” on the pane side by side\n\nMove “Select question” filter and “Answer” legend above the two charts\n\nClick triangle and check “Single Value (dropdown)”\n\nDrag and drop “A Text” object below the “Answer” legend. then type below\n\nAdjust sizes of boxes we put\n\nDrag and drop two more “A Text” objects between “Answer” label box and two charts. Then type titles for the charts, repectively.\n 8. Lastly, drag and drop “A Text” objects below the two charts and type data source information.\n\nThe final Dashboard\n\n5. Major observations\nLabaging\n5.1. Changes of the share of residents population\nAs illustrated in the statement in original chart, the share of senior population is getting larger than before. The share of residents aged 55-64 and 65&over rose from 14% (2009) to 17% (2019) and from 11% (2009) to 17%(2019), respectively. Whereas, the share of young age groups declined from 59% (2009) to 52% (2019). This fact affects to changes of the share of resident labour force consequently, because the working young population cohorts moving into the senior group.\n5.2. Changes of LFPR\nOverall LFPR (Labour Force Participation Rate) rose since 2009, however, among 55-64 and 65&over age group’s increments were relatively huge than 25-54 age cohort. Especially, 65&over cohort’s fluctuation was norteworthy, which means that more seniors take part in work activity than 10 years ago. Also, we can assumes that the fact of big changes of LFPR affects to the share of resident labour force.\n5.3. Changes of the share of resident labour force\nConsequently, this whole report and charts were written to explain that Labour force in Singapore is aging. As seen in the dashboard, 9.1% of the shares of resident labour force in aged 55&over, orange colored part in Figure3, rose from 2009 to 2019. As a result, median age of residents in the labour force rose from 41 years in 2009 to 44 years in 2019.\nThe END\n\n\n\n",
    "preview": {},
    "last_modified": "2021-02-19T01:34:01+08:00",
    "input_file": "Assignment2.utf8.md"
  },
  {
    "path": "posts/2021-01-20-Assignment1/",
    "title": "ISSS608 AY2020-21_T2 Visual Analytic DataViz Makeover1",
    "description": "Description: Visualisation and analysis of MOM(Manpower Research and Statistics Department) Report on Labour Force in Singapore 2019",
    "author": [
      {
        "name": "Jihun NAM",
        "url": {}
      },
      {
        "name": "",
        "url": {}
      }
    ],
    "date": "2021-01-28",
    "categories": [],
    "contents": "\n1. Overview\nThe Report on Labour Force in Singapore is an annual report on Singapore’s labour market and it analyses diverse facets of Singapore’s labour force. In this post, the chart 6 “Resident labour force by age) in the original report will be evaluated in terms of”clarity\" and “aesthetics”. Then an alternative graphical presentation that represents more easier to understand the context will be presented and discussed.\nOriginal chart\nFigure0 : Original visualisationThe original source of the data can be found on page 22 of report: Report: Labour Force in Singapore 2019\nThe data is available at https://stats.mom.gov.sg/Pages/Labour-Force-Tables2019.aspx, and below three datasets were used for analysis.\nTable2: Key Characteristics of Resident Labour Force, 2009 - 2019 (June)\nTable5: Resident Labour Force Participation Rate by Age and Sex, 2009 - 2019 (June)\nTable7: Resident Labour Force Aged Fifteen Years and Over by Age and Sex, 2009 - 2019 (June)\n2. Critiques of the graph\n2.1. Clarity\n1) Missing graphs for illustration\nThe explanation above this chart illustrates four big things: (1) the share of residents population, (2) LFPR(Labour Force Prticipation Rate), (3) share of resident labour force, (4) Median age of residents. However, information of (3) and (4) is displayed in the chart and other two are merely stated in words.\nEspecially, (1) the share of residents population by age is mentioned only with footnotes, so it is difficult to understand and match the other data. Also, LFPR graph is not shown in this chart, so understanding the trend of changes of LFPR is difficult.\n2) Missing data for comparison\nTo compare the data accurately, all the data sets should be ready for use. Closely looking into LFPR data set (Table 5), LFPR of 55 & over age group data does not exist. Therefore, we cannot use the figures of 55 & over age group to compare with the share of residents population. To make all the data sets in the same format, the share of residents population data set should be divided into four age groups, 15-24, 25-54, 55-64, and 65&over.\n3) Inappropriate usage of graph\nThe median age of residents data between two years(2009 and 2019) are being displayed with dotted lines. However, because the figures of median age are continuous values, putting the dotted lines on categorical variables (age groups) is inappropriate.\n2.2. Aesthetics\n1) Selection of graph\nIn this chart, line graphs are used to show changes of the share of resident labour force by age. However, it is hard to understand how amounts of the share among the age groups were changed.\n2) Highlighting of important message\nIn order to make readers understand easier, at least this chart needs to highlight important figures to deliever clearer message.\nEven the table bellow the line graphs show that the figures of the share of each age group, readers can not easily sum up the figures to evaluate the differences between two fiscal years.\n3) Labelling and captions\n“June 20xx” labels are inserted multiple times unnecessarily. The duplicated labels can be removed to make the chart much simpler.\n“Per Cent” caption should be placed within the graph.\n“Source” and “Note” bellow the charts are not aligned, in terms of format.\n3. Alternative suggestion of the graph\n3.1. Sktechs of graphical presentation and advantages\n1) Sketch1 - The share of residents population\nThe first key message to convey is the change in the share of residents population. Bellow box plot clearly shows that the changes in shares of resident population among the age groups and between two years(2009 and 2019).\nFigure1 : Sketch12) Sketch2 - LFPR by age\nIn addition, the second key message to deliver is the change in LFPR (Labour Force Participation Rate). Bellow box plot also clearly displays the changes in LFPR among the age groups and between two years.\nFigure2 : Sketch23) Sketch3 - The share of resident labour force\nThe chart bellow Figure3 represents the portion of changes of the share of resident labour force between 2009 and 2019.\nFigure3 : Sketch34) Sketch4 - Median age of residents\nThe change of median age of residents in the labour force between 2009 and 2019 can be shown clearer with line graph.\nFigure4 : Sketch43.2. Final dashboard of visualisation using Tableau.\nAll the charts we designed above were rearranged for one cleaned dashboard Figure5 : Final Dashboard\n4. Step-by-step preparation of visualization\n4.1. Preparation for data sets\nData set\nSource\n1) Resident labour force participation rate by age\nTable5 (Resident Labour Force Participation Rate by Age and Sex, 2009 - 2019 (June))\n2) The share of resident labor force\nTable7 (Resident Labour Force Aged Fifteen Years and Over by Age and Sex, 2009 - 2019 (June))\n3) The share of residents population by age\nTable7 and Table5 are used for counter-calculation. The population figures are calculated by dividing “Resident labour force(Table7)” by “Resident labour force participation rate(Table5)”\n4) The Median age of labour force\nTable2 (Key Characteristics of Resident Labour Force, 2009 - 2019)\n4.2. Upload integrated data set in Tableau\nAfter pivoting and merging all the data sets using excel, the integrated data set is imported via Tableau\nFigure6 : integrated dataset4.3. Creating charts\nNext, Tableau’s Polaris was used to create the charts\n1) Creating chart of the share of residents population and chart of LFPR by age\nFigure7 : Share of residents population and LFPR by age\nAfter adding Category, Age, and Year to Columns, drag and drop Percent(: attribute name of all the figures) to Rows.\nAdd Age to Filters and check 15-24, 25-54, 55-64, and 65&over.\nDrag and drop Year to Marks > Color and change Marks type from Automatic to Bar.\nIn order to show the differnces between 2009 and 2019 values, drag and drop Percent to Rows and change Marks type to Line. Then select dual axis to combine both charts.\nIn Marks > SUM(Percent)(2), exclude Year from color and click Color to change line’s color (to red).\nDrag and drop Percent to Label to show the values.\n\n2) Creating the chart of the share of resident labour force\nFigure8 : Share of residents Labour force by age\nAfter adding Age to Columns, drag and drop Percent to Rows.\nAdd Category and check “Share of the labour force” only.\nChange Marks type to Area and click Analysis > Stack Marks > Off.\nDrag and drop Year to color to differentiate between two years.\nCreate a new calculated field named Gaps and type {Exclude [Year]: MIN([Percent]) }.\nAdd Gaps to Rows then select dual axis to combine with previous chart.\nClick Marks>color and change Gaps to White with 100% opacity.\nAdd Percent to Rows again with Line graph then select dual axis.\n\nFigure9 : Share of residents Labour force by age (table)\nAfter adding creating the share of labour force worksheet, need to creat a new table to show the figures of each age group.\nDrag and drop Age to Columns and Year to Rows.\nClick Show Me to check Text Tables.\n\n3) Creating the chart of median age of residents\nFigure10 : Median age of residents\nDrag and drop Year to Columns and Percent to Rows.\nFillter Category and check Median only.\nHide and remain only 2009 and 2019 in x-axis.\n\n4) Creating dashboard merging whole charts\nFigure11 : Dashboard\nDrag and drop Objects>Text on top of the dashboard then type Title and descriptions.\nPut all the worksheets that we made on the dashboard and rearrange the size.\n\n5. Major observations\nLabour force in Singapore is aging\n5.1. Changes of the share of residents population\nAs illustrated in the statement in original chart, the share of senior population is getting larger than before. The share of residents aged 55-64 and 65&over rose from 14% (2009) to 17% (2019) and from 11% (2009) to 17%(2019), respectively. Whereas, the share of young age groups declined from 59% (2009) to 52% (2019). This fact affects to changes of the share of resident labour force consequently, because the working young population cohorts moving into the senior group.\n5.2. Changes of LFPR\nOverall LFPR (Labour Force Participation Rate) rose since 2009, however, among 55-64 and 65&over age group’s increments were relatively huge than 25-54 age cohort. Especially, 65&over cohort’s fluctuation was norteworthy, which means that more seniors take part in work activity than 10 years ago. Also, we can assumes that the fact of big changes of LFPR affects to the share of resident labour force.\n5.3. Changes of the share of resident labour force\nConsequently, this whole report and charts were written to explain that Labour force in Singapore is aging. As seen in the dashboard, 9.1% of the shares of resident labour force in aged 55&over, orange colored part in Figure3, rose from 2009 to 2019. As a result, median age of residents in the labour force rose from 41 years in 2009 to 44 years in 2019.\nThe END\n\n\n\n",
    "preview": {},
    "last_modified": "2021-02-18T08:41:52+08:00",
    "input_file": "Assignment1.utf8.md"
  },
  {
    "path": "posts/2021-01-20-MarkDown-Guide/",
    "title": "MarkDown Guide",
    "description": "This is MarkDown Guide",
    "author": [
      {
        "name": "Jihun NAM",
        "url": "https://github.com/jeerohoon"
      }
    ],
    "date": "2021-01-20",
    "categories": [],
    "contents": "\nFirst Level Header\ncontent\nSecond Level Header\ncontent\nThis is a first thing\nThis is a second thing\nThis is a third thing\nbullet one\nbullet two\nbullet three new content1 new content2 > Blockquotes\nOfficial Guide Link\nYou can insert links like this https://www.markdownguide.org/basic-syntax/.\nOr you can insert links like this my website.\nOr you can insert links with caption like this my website.\nOr link for official guide https://www.markdownguide.org/basic-syntax/\nImportant Features\nEmphasis\nBold To bold text, add two asterisks or underscores before and after a word or phrase. To bold the middle of a word for emphasis, add two asterisks without spaces around the letters.\nI just love bold text.\nI just love bold text.\nItalic To italicize text, add one asterisk or underscore before and after a word or phrase. To italicize the middle of a word for emphasis, add one asterisk without spaces around the letters.\nItalicized text is the cat’s meow.\nItalicized text is the cat’s meow.\nAcatmeow\nBold and Italic To emphasize text with bold and italics at the same time, add three asterisks or underscores before and after a word or phrase. To bold and italicize the middle of a word for emphasis, add three asterisks without spaces around the letters.\nThis text is really important.\nThis text is really important.\nThis text is really important.\nThis text is really important.\nThis is reallyveryimportant text.\nEmphasis\nBlockquotes To create a blockquote, add a > in front of a paragraph.\n\nDorothy followed her through many of the beautiful rooms in her castle.\n\nBlockquotes with Multiple Paragraphs Blockquotes can contain multiple paragraphs. Add a > on the blank lines between the paragraphs.\n\nDorothy followed her through many of the beautiful rooms in her castle.\nThe Witch bade her clean the pots and kettles and sweep the floor and keep the fire fed with wood.\n\nNested Blockquotes Blockquotes can be nested. Add a >> in front of the paragraph you want to nest.\n\nDorothy followed her through many of the beautiful rooms in her castle.\n\nThe Witch bade her clean the pots and kettles and sweep the floor and keep the fire fed with wood.\n\n\nBlockquotes with Other Elements Blockquotes can contain other Markdown formatted elements. Not all elements can be used — you’ll need to experiment to see which ones work.\n\nThe quarterly results look great!\nRevenue was off the chart.\nProfits were higher than ever.\nEverything is going according to plan.\n\nImages\nFrom image file To add an image, add an exclamation mark (!), followed by alt text in brackets, and the path or URL to the image asset in parentheses. You can optionally add a title after the URL in the parentheses.\nTest image!From link To add a link to an image, enclose the Markdown for the image in brackets, and then add the link in parentheses.\n\nReference-style Links\nReference-style links are a special kind of link that make URLs easier to display and read in Markdown. Reference-style links are constructed in two parts: the part you keep inline with your text and the part you store somewhere else in the file to keep the text easy to read.\nIn one example, researchers studied the covid Bastard et al. (2020). COVID (2020)\nReferences\n\n\n\nBastard, Paul, Lindsey B. Rosen, Qian Zhang, Eleftherios Michailidis, Hans-Heinrich Hoffmann, Yu Zhang, Karim Dorgham, Quentin Philippot, Jérémie Rosain, and Vivien Béziat. 2020. “Autoantibodies Against Type I IFNs in Patients with Life-Threatening COVID-19.” Science 370 (6515).\n\n\nCOVID, Team CDC. 2020. Characteristics of Health Care Personnel with COVID-19-United States, February 12-April 9, 2020.\n\n\n\n\n",
    "preview": {},
    "last_modified": "2021-01-28T11:09:27+08:00",
    "input_file": "MarkDown-Guide.utf8.md"
  },
  {
    "path": "posts/2021-01-04-my-first-post/",
    "title": "My first post",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "Jihun NAM",
        "url": "https://github.com/jeerohoon"
      }
    ],
    "date": "2021-01-04",
    "categories": [],
    "contents": "\n1.0 Overview\nCorrelation coefficient is a popular statistic that use to measure the type and strength of the relationship between two variables. The values of a correlation coefficient ranges between -1.0 and 1.0. A correlation coefficient of 1 shows a perfect linear relationship between the two variables, while a -1.0 shows a perfect inverse relationship between the two variables. A correlation coeficient of 0.0 shows no linear relationship between the two variables.\nWhen multivariate data are used, the correlation coeficeints of the pair comparisons are displayed in a table form known as correlation matrix or scatterplot matrix.\nThere are three broad reasons for computing a correlation matrix.\nTo reveal the relationship between highdimensional variables pairwisely.\nTo input into other analyses. For example, people commonly use correlation matrixes as inputs for exploratory factor analysis, confirmatory factor analysis, structural equation models, and linear regression when excluding missing values pairwise.\nAs a diagnostic when checking other analyses. For example, with linear regression a high amount of correlations suggests that the linear regression’s estimates will be unreliable.\nWhen the data is large, both in terms of the number of observations and the number of variables, Corrgram tend to be used to visually explore and analyse the structure and the patterns of relations among variables. It is designed based on two main schemes:\nRendering the value of a correlation to depict its sign and magnitude, and\nReordering the variables in a correlation matrix so that “similar” variables are positioned adjacently, facilitating perception.\nIn this hands-on exercise, you will learn how to plot data visualisation for visualising correlation matrix with R. It consists of three main sections. First, you will learn how to create correlation matrix using pairs() of R Graphics. Next, you will learn how to plot corrgram using corrplot package of R Lastly, you will learn how to create an interactive correlation matrix using plotly R. .\n2.0 Installing and Launching R Packages\nBefore you get started, you are required:\nto start a new R project, and\nto create a new R Markdown document.\nNext, you will use the code chunk below to install and launch corrplot, ggpubr, plotly and tidyverse in RStudio.\n\n\npackages = c('ggpubr', 'tidyverse')\n\nfor(p in packages){library\n  if(!require(p, character.only = T)){\n    install.packages(p)\n  }\n  library(p, character.only = T)\n}\n\n\n\n3.0 Importing and Preparing The Data Set\nIn this hands-on exercise, the Wine Quality Data Set of UCI Machine Learning Repository will be used. The data set consists of 13 variables and 6497 observations. For the purpose of this exercise, we have combined the red wine and white wine data into one data file. It is called wine_quality and is in csv file format.\n3.1 Importing Data\nFirst, let us import the data into R by using read_csv() of readr package.\n\n\nwine <- read_csv(\"data/wine_quality.csv\")\n\n\n\nNotice that beside quality and type, the rest of the variables are numerical and continuous data type.\n4.0 Univariate EDA with Histogram\nIn the figure below, multiple histograms are plottted to reveal the distribution of the selected variables in the wine quality data sets.\n\n\n\nThe code chunks used to create the data visualisation consists of two main parts. First, we will create the individual histograms using the code chunk below.\n\n\nfa <- ggplot(data=wine, aes(x= `fixed acidity`)) +\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\nva <- ggplot(data=wine, aes(x= `volatile acidity`)) +\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\nca <- ggplot(data=wine, aes(x= `citric acid`)) +\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\nrs <- ggplot(data=wine, aes(x= `residual sugar`)) +\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\nch <- ggplot(data=wine, aes(x= `chlorides`)) +\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\nfSO2 <- ggplot(data=wine, aes(x= `free sulfur dioxide`)) +\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\ntSO2 <- ggplot(data=wine, aes(x= `total sulfur dioxide`)) +\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\ndensity <- ggplot(data=wine, aes(x= density)) +\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\npH <- ggplot(data=wine, aes(x= pH)) +\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\nsulphates <- ggplot(data=wine, aes(x= sulphates)) +\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\nalcohol <- ggplot(data=wine, aes(x= alcohol)) +\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\n\n\n\nNext, the ggarrange function of ggpur package is used to group these histograms together.\n\n\nggarrange(fa, va, ca, rs, ch, fSO2, tSO2, density, pH, sulphates, alcohol, \n          ncol = 4, nrow = 3)\n\n\n\n\n\n\n",
    "preview": "posts/2021-01-04-my-first-post/my-first-post_files/figure-html5/unnamed-chunk-3-1.png",
    "last_modified": "2021-01-28T13:16:04+08:00",
    "input_file": "my-first-post.utf8.md"
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to IDEA",
    "description": "Welcome to our new blog, IDEA. We hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "Jihun NAM",
        "url": "https://github.com/jeerohoon"
      }
    ],
    "date": "2021-01-04",
    "categories": [],
    "contents": "\n\n\n\n",
    "preview": {},
    "last_modified": "2021-01-04T20:59:41+08:00",
    "input_file": {}
  }
]
